cask_args appdir: '/Applications'

tap 'microsoft/git'

# Esentials
brew 'coreutils'
brew 'git'
brew 'git-extras'
brew 'gh'

brew 'openssl'
brew 'wget'

# Python dev
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'pre-commit'

# Other dev
brew 'node'
brew 'rbenv'
brew 'jenv'
brew 'go'
brew 'ipython'

# Useful cli
brew 'tree'
brew 'bat'
brew 'jq'
brew 'yarn'
brew 'awscli'
brew 'aws-shell'
# https://github.com/Peltoche/lsd/issues/199#issuecomment-494218334
brew 'lsd'
brew 'git-delta'
brew 'fd'
brew 'fzf'
brew 'atuin'
brew 'git-interactive-rebase-tool'
brew 'mas'

# Kubernetes
cask 'docker'
brew 'kubie'
brew 'stern'

# Apps
cask 'alfred'
cask 'meetingbar'
cask 'setapp'
cask 'maccy'
cask 'telegram'
cask 'messenger'
cask 'iterm2'
cask 'slack'
cask 'visual-studio-code'
cask 'iina'
cask 'appcleaner'
cask 'whatsapp'
cask 'google-drive'
cask 'rocket'
cask 'rectangle-pro'
cask 'the-unarchiver'
cask 'macupdater'
cask 'git-credential-manager'
cask 'spotify'
cask '1password'
cask 'lunar'
cask 'todoist'
cask 'karabiner-elements'
cask 'mimestream'

# Bartender substitute
cask 'jordanbaird-ice'

# Fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'

# Quick Look Plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

