cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'github/gh/gh'
brew 'node'
brew 'bat'
brew 'openssl'
brew 'wget'
brew 'youtube-dl'
brew 'python3'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-pyenv-virtualenvwrapper'
brew 'rbenv'
brew 'jenv'
brew 'ipython'
brew 'tree'
brew 'jq'
brew 'yarn'
brew 'pgcli'
brew 'awscli'
brew 'aws-shell'
brew 'go'
# https://github.com/Peltoche/lsd/issues/199#issuecomment-494218334
brew 'lsd'
brew 'lazydocker'
brew 'lazygit'
brew 'switchaudio-osx'
brew 'git-delta'
brew 'pre-commit'

cask 'iterm2'
cask 'alfred'
cask '1password'
cask 'dropbox'
cask 'slack'
cask 'visual-studio-code'
cask 'bartender'
cask 'iina'
cask 'appcleaner'
cask 'docker'
cask 'postman'
cask 'whatsapp'
cask 'istat-menus'
cask 'clipy'
cask 'paw'
cask 'rocket'
cask 'the-unarchiver'
cask 'bettertouchtool'
cask 'authy'
cask 'macupdater'
cask 'font-fira-code'

# Quick Look Plugins
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

